<a href="https://colab.research.google.com/github/mominulhaque666/CSE445.3-Assignment/blob/main/SalesForecast/SalesForecast.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
# Import Libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import warnings
warnings.filterwarnings('ignore')

pd.set_option('display.max_columns', 50)

In [3]:
# Upload the model & date wise sales dataset

sales = 'https://raw.githubusercontent.com/mominulhaque666/CSE445.3-Assignment/main/SalesForecast/Date%20and%20model%20wise%20sale.csv'

In [4]:
# Read the audit risk dataset

sales_df = pd.read_csv(sales)
sales_df

            Date Model  Count
0      31-Aug-16   M45      5
1      31-Aug-16  M121      3
2      31-Aug-16  M122      4
3      31-Aug-16   M91     10
4      31-Aug-16   M66     57
...          ...   ...    ...
46111  01-Jan-14   M74      1
46112  01-Jan-14   M59      1
46113  01-Jan-14   M60      5
46114  01-Jan-14   M54      1
46115  01-Jan-14   M58      1

[46116 rows x 3 columns]

In [5]:
sales_df.head(10)

        Date Model  Count
0  31-Aug-16   M45      5
1  31-Aug-16  M121      3
2  31-Aug-16  M122      4
3  31-Aug-16   M91     10
4  31-Aug-16   M66     57
5  31-Aug-16  M100     59
6  31-Aug-16    M5     17
7  31-Aug-16   M14    653
8  31-Aug-16   M62      8
9  31-Aug-16   M15     25

In [6]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46116 entries, 0 to 46115
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    46116 non-null  object
 1   Model   46116 non-null  object
 2   Count   46116 non-null  int64
dtypes: int64(1), object(2)
memory usage: 1.1+ MB

In [7]:
sales_df.describe()

              Count
count  46116.000000
mean      96.690108
std      315.065946
min        1.000000
25%        3.000000
50%       14.000000
75%       67.000000
max     6678.000000

In [9]:
# Convert string Date column to datetime

sales_df['Date'] = pd.to_datetime(sales_df['Date'])

In [10]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46116 entries, 0 to 46115
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    46116 non-null  datetime64[ns]
 1   Model   46116 non-null  object
 2   Count   46116 non-null  int64
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 1.1+ MB

In [11]:
sales_df.head()

        Date Model  Count
0 2016-08-31   M45      5
1 2016-08-31  M121      3
2 2016-08-31  M122      4
3 2016-08-31   M91     10
4 2016-08-31   M66     57

In [12]:
sales_df['Model'].value_counts()

M119    926
M70     778
M97     770
M88     769
M43     748
       ...
M14      13
M84      10
M42       2
M47       1
M12       1
Name: Model, Length: 124, dtype: int64

In [15]:
sales_df.isnull().sum()

Date     0
Model    0
Count    0
dtype: int64

In [16]:
sales_df.nunique()

Date      971
Model     124
Count    1191
dtype: int64